BusinessProcesses/ОбратнаяСвязьЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<BusinessProcess>
		<Properties>
			<Name>ОбратнаяСвязьЛояльности</Name>
			<Task>Task.ЗадачаОбратнаяСвязь</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительОбратнойСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Пользователь системы, создавщий и стартовавший процесс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наблюдатель</Name>
					<Comment>В этом БП не используется, добавлено для совместимости с другими. Не удалять. Есть ссылка в модуле задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработаннаяАнкетаПризнанаКорректной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеИнициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеИсполнитель</Name>
					<Comment>Роль в адресации этого бизнес-процесса используется всегда одна "Клиентская служба регионы оператор"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКонтролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураПродажи</Name>
					<Comment>Сигнутатура продажи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗавершения</Name>
					<Comment>Дата выполнения плановая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон контактного лица, ответившего на анкету опроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/БизнесПроцессыЗначенияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>БизнесПроцессыЗначенияСвойств</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БизнесПроцессы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесПроцессыСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BusinessProcesses/ОбратнаяСвязьЛояльности/Ext/ObjectModule.bsl
//**************************************************************************
//Общая (технологическая) часть
//**************************************************************************

Функция ПолучитьКартуМаршрутаОбъектаБП() Экспорт
	ГрафичСхемаКартаМаршрутаОбъектаБП = ЭтотОбъект.ПолучитьКартуМаршрута();
	Возврат ГрафичСхемаКартаМаршрутаОбъектаБП
КонецФункции

Функция ПроверьУсловие(ТочкаМаршрутаБизнесПроцесса)
	
	ВхТочки = ТочкаМаршрутаБизнесПроцесса.ПолучитьВходящиеТочки();
	Если ВхТочки.Количество()=0 Тогда
		Данные = "БизнесПроцесс = " + Ссылка+" ТочкаМаршрута = "+ТочкаМаршрутаБизнесПроцесса.Имя; 
		Комментарий = "Ошибка получения предыдущей точки бизнес-процесса";
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("Ошибка получения предыдущей точки бизнес-процесса", УровеньЖурналаРегистрации.Ошибка, Метаданные.БизнесПроцессы.ОбратнаяСвязьЛояльности, Данные, Комментарий, "Сервер"); 
	КонецЕсли;
	
	ВхТочка = ВхТочки[0];
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачаОбратнаяСвязь.ОценкаВыполненияПредшествующейЗадачи КАК Оценка
	|ИЗ
	|	Задача.ЗадачаОбратнаяСвязь КАК ЗадачаОбратнаяСвязь
	|ГДЕ
	|   ЗадачаОбратнаяСвязь.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачаОбратнаяСвязь.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ВхТочка);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Истина;	
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Оценка = Выборка.Оценка;
	
	Если Оценка >= 3 Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000004"); //Оценка выполнения последней задачи
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, Строка(Выборка.Оценка), "Строка");

	Возврат Результат
	
КонецФункции

Функция ВыполнитьКод(ИмяПараметра)
	Парам = Новый Структура();
	Парам.Вставить(ИмяПараметра);
	
	//Получи значение параметра из учетной политики
	//--------------------------------------------------------------------------	
	ЗначениеПараметраНайдено = РегистрыСведений.УчетнаяПолитика.Получи(Парам);
	Если  ЗначениеПараметраНайдено = Ложь Тогда 
		Возврат "";
	КонецЕсли;
	
	//Проверь наличие значения параметра
	//---------------------------------------------------
	Если ТипЗнч(Парам[ИмяПараметра])<> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(Парам[ИмяПараметра]) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	//Выполнить код
	//-------------
	Попытка
		Выполнить(Парам[ИмяПараметра]);
	Исключение
		Данные = "ИмяПараметра = "+ИмяПараметра+"; ЗначениеПараметра = " + Парам[ИмяПараметра];
		Комментарий = ОписаниеОшибки();
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("Ошибка Выполнить()", УровеньЖурналаРегистрации.Ошибка, Данные, Комментарий,, "Сервер");
	КонецПопытки;		
КонецФункции


//********************************************************************************
// Программный код точек бизнес-процесса
//********************************************************************************

Процедура УстановитьСтатус_ОжидаетОбработки_1(ТочкаМаршрутаБизнесПроцесса)		
	//ВыполнитьКод("АнкетыОбратнаяСвязь__УстановитьСтатус_ОжидаетОбработки_1");
	
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает обработки", "Строка");
	
КонецПроцедуры

Процедура УстановитьСтатус_ОжидаетСогласования_1(ТочкаМаршрутаБизнесПроцесса)
	//ВыполнитьКод("АнкетыОбратнаяСвязь__УстановитьСтатус_ОжидаетСогласования_1");
	
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает согласования", "Строка");

КонецПроцедуры

Процедура УстановитьСтатус_ОбращениеЗакрыто(ТочкаМаршрутаБизнесПроцесса)
	
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Закрыто", "Строка");
	
	Попытка
		ЭтотОбъект.ДатаЗавершения=ТекущаяДата();
		ЭтотОбъект.Записать();
	Исключение
		Данные = ЭтотОбъект.Ссылка; 
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("УстановитьСтатус_ОбращениеЗакрыто->БП.Записать()", УровеньЖурналаРегистрации.Ошибка, Метаданные.БизнесПроцессы.ОбратнаяСвязьЛояльности, Данные, Комментарий);
	КонецПопытки;
	
КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)	
	Результат = Не ПроверьУсловие(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура УстановитьСтатус_ВозвращеноВРаботу_2(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Возвращено в работу", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ОжидаетСогласования_2(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает согласования", "Строка");
КонецПроцедуры

Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Не ПроверьУсловие(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

//************************************************************************************
// Обработчики событий точек маршрута
//************************************************************************************

Процедура ОбработатьНегативнуюАнкету_1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаРегионы_Оператор"); //это задано в точке маршрута
		ЗадОб.Подразделение 		= ЭтотОбъект.ПодразделениеИсполнитель;
		ЗадОб.ДопРеквизитАдресации	= ЭтотОбъект.ДопРеквизитАдресации;

		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение, ЗадОб.ДопРеквизитАдресации);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОбработаннуюНегативнуюАнкету_1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаЦентр_Администратор"); //это задано в точке маршрута
		ЗадОб.Подразделение = ЭтотОбъект.ПодразделениеКонтролер;
		
		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение);
		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьНегативнуюАнкету_2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаРегионы_Оператор"); //это задано в точке маршрута
		ЗадОб.Подразделение 				= ЭтотОбъект.ПодразделениеИсполнитель;
		ЗадОб.ДопРеквизитАдресации	= ЭтотОбъект.ДопРеквизитАдресации;

		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение, ЗадОб.ДопРеквизитАдресации);

	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОбработаннуюНегативнуюАнкету_2ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаЦентр_Администратор"); //это задано в точке маршрута
		ЗадОб.Подразделение = ЭтотОбъект.ПодразделениеКонтролер;
		
		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение);

	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьНегативнуюАнкету_3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаРегионы_Оператор"); //это задано в точке маршрута
		ЗадОб.Подразделение 				= ЭтотОбъект.ПодразделениеИсполнитель;
		ЗадОб.ДопРеквизитАдресации	= ЭтотОбъект.ДопРеквизитАдресации;

		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение, ЗадОб.ДопРеквизитАдресации);

	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОбработаннуюНегативнуюАнкету_3ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаЦентр_Администратор"); //это задано в точке маршрута
		ЗадОб.Подразделение = ЭтотОбъект.ПодразделениеКонтролер;
		
		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение);

	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьНегативнуюАнкету_4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаРегионы_Оператор"); //это задано в точке маршрута
		ЗадОб.Подразделение 				= ЭтотОбъект.ПодразделениеИсполнитель;
		ЗадОб.ДопРеквизитАдресации	= ЭтотОбъект.ДопРеквизитАдресации;

		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение, ЗадОб.ДопРеквизитАдресации);

	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОбработаннуюНегативнуюАнкету_4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаЦентр_Администратор"); //это задано в точке маршрута
		ЗадОб.Подразделение = ЭтотОбъект.ПодразделениеКонтролер;
		
		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение);
		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьНегативнуюАнкету_5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаРегионы_Оператор"); //это задано в точке маршрута
		ЗадОб.Подразделение 				= ЭтотОбъект.ПодразделениеИсполнитель;
		ЗадОб.ДопРеквизитАдресации	= ЭтотОбъект.ДопРеквизитАдресации;

		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение, ЗадОб.ДопРеквизитАдресации);

	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОбработаннуюНегативнуюАнкету_5ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого ЗадОб Из ФормируемыеЗадачи Цикл
		
		//ЗадОб.Роль = ПредопределенноеЗначение("Справочник.Роли.КлиентскаяСлужбаЦентр_Администратор"); //это задано в точке маршрута
		ЗадОб.Подразделение = ЭтотОбъект.ПодразделениеКонтролер;
		
		//Определи исполнителя задачи  по модели ролевой адресации
		//-----------------------------------------------------------
		ЗадОб.Исполнитель	= ПроцессыСервер.НазначьИсполнителя(ЗадОб.Роль, ЗадОб.Подразделение);

	КонецЦикла;
КонецПроцедуры

Процедура Условие3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Не ПроверьУсловие(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура Условие4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Не ПроверьУсловие(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура УстановитьСтатус_ВозвращеноВРаботу_3(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Возвращено в работу", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ОжидаетСогласования_3(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает согласования", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ВозвращеноВРаботу_4(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Возвращено в работу", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ОжидаетСогласования_4(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает согласования", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ВозвращеноВРаботу_5(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Возвращено в работу", "Строка");
КонецПроцедуры

Процедура УстановитьСтатус_ОжидаетСогласования_5(ТочкаМаршрутаБизнесПроцесса)
	Свойство = Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"); //Статус бизнес-процесса
	РегистрыСведений.БизнесПроцессыЗначенияСвойств.Добавить(ТекущаяДата(), ЭтотОбъект.Ссылка, Свойство, "Ожидает согласования", "Строка");
КонецПроцедуры
